app/controllers/api/feeds_controller.rb

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def require_feed_exists
    @feed = Feed.find_by(id: params['id'])

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def require_ownership_feed
    @feed = Feed.find(params['id'])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = $1  [["user_id", 3]]
SELECT  1 AS one FROM "feeds" WHERE "feeds"."user_id" = $1 LIMIT $2  [["user_id", 9], ["LIMIT", 1]]
---
  def index
    @feeds = current_user.feeds.order("name ASC")

    unless @feeds.empty?

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @feed = Feed.find(params['id'])

INSERT INTO "feeds" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Feed1v2"], ["user_id", 4], ["created_at", "2019-07-05 23:25:29.358398"], ["updated_at", "2019-07-05 23:25:29.358398"]]
---
  def create
    @feed = Feed.new(feed_params)
    @feed[:user_id] = current_user.id;

    if @feed.save

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "feeds" SET "name" = $1, "updated_at" = $2 WHERE "feeds"."id" = $3  [["name", "Feed1v2"], ["updated_at", "2019-07-05 22:02:57.342063"], ["id", 4]]
---
  def update
    @feed = Feed.find(params['id'])

    if @feed.update_attributes(feed_params)

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 16]]
---
  def destroy
    @feed = Feed.find(params['id'])

    if @feed.destroy