app/controllers/api/sources_controller.rb

SELECT  "sources".* FROM "sources" WHERE "sources"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def require_source_exists
    @source = Source.find_by(id: params['id'])

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def index
    if (params['feed_id'] == nil)
      @sources = current_user.sources.order("name ASC")
      render "api/sources/index"
      return
    end

    feed = Feed.find_by(id: params['feed_id'])

SELECT  "sources".* FROM "sources" WHERE "sources"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @source = Source.find_by(id: params['id'])