app/views/api/users/_user.json.jbuilder

SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = $1  [["user_id", 5]]
---
json.extract! user, :id, :email, :username
json.subscribedFeeds user.feeds.to_a.map { |feed|  feed[:id] }