app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "axfKbGbwse4IsjenS0ZdcA"], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.find_by(session_token: session[:session_token])