app/views/api/feeds/_feed.json.jbuilder

json.extract! feed, :id, :name
json.sourceIds feed.sources.to_a.map { |source| source[:id] }
---
SELECT "sources".* FROM "sources" INNER JOIN "follows" ON "sources"."id" = "follows"."source_id" WHERE "follows"."feed_id" = $1  [["feed_id", 7]]